android/docs/diagrams/nav_graph.dot
digraph {
    {
        node [shape=rectangle]
        splash [label="Splash"]
        login [label="Login"]
        connect [label="Connect"]
        too_many_devices [label="Too many devices"]
        welcome [label="Welcome"]
        revoked [label="Revoked"]
        privacy_policy [label="Privacy policy"]
        account [label="Account"]
        settings [label = "Settings"]
        report_problem [label = "Report problem"]
        view_logs [label = "View logs"]
        split_tunneling [label = "Split tunneling"]
        vpn_settings [label = "VPN settings"]
        switch_location [label = "Switch location"]
    }

    splash -> privacy_policy
    splash -> login
    splash -> connect
    splash -> revoked


    revoked -> login
    privacy_policy -> login

    login -> welcome
    login -> too_many_devices
    login -> settings
    login -> connect

    too_many_devices -> login

    welcome -> connect

    connect -> revoked
    connect -> settings
    connect -> account
    connect -> switch_location

    settings -> vpn_settings
    settings -> split_tunneling
    settings -> report_problem

    report_problem -> view_logs
}
